Firma/nalog_encrypted_and_signed.xml

<?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:getNalogZaPlacanjeRequest xmlns:ns2="http://nalogZaPlacanje.xml.com" xmlns:ns3="http://zahtevzadobijanjeizvoda.xml.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>Qcj4i4gzASs8mIQD/AosOlzujWOT4ZAOj+CDNNQrxEInKZ+ReTf7Uyw96emUWbZvT6qWfiAugNIJ&#13;
nDhCeGLHgvr1RlDXf7tp4Ggkc/dRMCK9ndx7XAy2UAJlQMD1KikWj+mJ04AaH/gdGpLKoFNUaNMH&#13;
tp+SoylZ1Nc3ARD2hwroigTIOXRzZv4Xugxbq5JrrNxRde01BMKOe1XQ5QvCKLgPoOTb2owteaCH&#13;
OnC2D8yQ4bVNGYjPMvZ3QWiXqwsDwgEFkuiYKONYu/fTr6AgItLTYoHcGbIVp50QYDlK/mfZFSNr&#13;
uOiSET9dljtJeqIOgcp4L6pEx+90/tLuuIxSeA==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>mu/SaIo9r7nyr25X725LQVvLUVVYqHpXWtobtUug69eFDQULZQI1TDzpARplkvfGwCTZnujfWVfC&#13;
2vQ7MjPJi+4OuLJIxGM3XVX18C1sj9JiMoDHk51NZeZl8ol6kfo/TH+rCkwW1Z9d5yXagi+nAeIq&#13;
EZs6xa0rAl2iho7Sf0I2ur6qj1CIm9ksTeNw1caBrd4N8F0b7U/lweqfSm0mjFb1YvoCT7fjnaXu&#13;
Gre2qK3/1BktOGSaT0mgmvstacdbcKzy91K1wZTyjJVP99Q2MjBOCXfZ0exDFThULW9FmE56IJVL&#13;
QSnnaDhljVZo6kQ6qKZO/XzUTfBB2Kt5e8Quy1uLoxMoB4Pa6/nAZQeKOe3qUDKOTght37p/Syd0&#13;
YQ7HgY3lH94SBO6nhRKmVnkOOY0+RkUKIq+cD7KnDSru/wCELtTjRL1RXZf+LhS8HeFXtZ79EQgD&#13;
7UDDJQ/BMDXgedUnKf4C3NWioUbcrzmT7mprw1OtXUz8j87KcGw/WS0OyTpfTAyM83NzfDEra6qt&#13;
h/SZGQ7mTgAFj+djBflc/Bxjqw0JlQBVh4qrsSEj+q9NwQ7tKrQNniycVCxCNfbgx5pMNnGH6t4i&#13;
UOa0rnZS3V6ZA9/hN658Pfht6A80iBfJhd0OZ2qNC5RoXQLZXzHKsHvcaT6NbXyk7uYu47nZrjJK&#13;
5vl0sfWe3xRdkO/Vyfm/KPgtWYAt5/lcVexf+YWNxgs2yEAka0xcwPjgyWClFcN959b2ry1J2mXh&#13;
u2ZccGYGVQB5vz/+7IIf5esaBFRrmFh88pKIYTLtSdBp2t3dBmhC3xwTQjPdjo6GFyTfe1iCY/m+&#13;
mCqqNSVZYEP6s5CMU0JVVuEzw5tErwcqUMYha4t4buSQhcMYMdJXzwFvNKNCMaw7Vn8rxWzoqkp2&#13;
U05zXc7tqlElc7udLaKeW3nhZC6CGRq3AVQOnBtkbzdRcD4d</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns2:getNalogZaPlacanjeRequest></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>2AvjP/qqYBx/5TEf+4VFzVgTWNM=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
YSxQwZDwFh81z7pYHuZTWCjfTCnk9FIE1p/TanU8nNHrjrc3V/C46qf54gN7tIIzeHwXiDeTqqRv&#13;
s1Nva8+F5Yk5zz2Hrx1S0EZjJ2NNovn3OZ8wjN+5/WKIT3yVV7SOJewL4DV3U6AmYkOEhFxXmacx&#13;
DbdxME+ZTb158lsgnoG0paqWfnPVVIVnspj4e2CN8czT1mCm+Wn2Uj0FCD185dg6zrEwCEhY6mJ3&#13;
ateOGjXuinaqGXvp79F5elpK8pUrgII5ihPt5o2kZKz3zWq+KnA1UouAEhiW21rTs6/JlUqKuDG9&#13;
7c71UU5OaAlgWrMWE7H4TS8kPlMCt1hIPyI6UA==
</ds:SignatureValue>
<ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
qvq9L4TdlpRND/aAnYa969IckeVyjGtDV1DHs/GvtFYRHuW6giXxjm3SUtVtTQoRTIoqBSLfpMBe&#13;
JODaAh6rACQpAgWymU4pbRXz7UIPhhpkyNeEXwtl63ILNOtIj6bMGtKnj6cmMYzNvUoQBixbFTSg&#13;
ixi3O996Z/YvRQLgW1obxiooCBoZuFEnFlfcUzCtHE5XmvZUWs4EjNA/oj9H2rJ34SMBz89XNyTl&#13;
0TBQh4ZPYw0WxzDJAyrtAGLWaPq1vOyA8PnXX33kQHGB7ZJVTVDlsFoD3ftWYQ63/LPshqM3P8BE&#13;
/uav8luUhVcVRDCDfvvpvmmJSVi7fK0zY4QQ7Q==
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIDgjCCAmqgAwIBAgIEWUhRPjANBgkqhkiG9w0BAQsFADB6MRAwDgYDVQQDDAdCYW5rYSBBMRAw&#13;
DgYDVQQKDAdCYW5rYSBBMQ4wDAYDVQQLDAVCYW5rYTEMMAoGA1UEBhMDc3JiMRowGAYJKoZIhvcN&#13;
AQkBFgtiYW5rYUBhLmNvbTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE0OTIwHhcNMTcwNjE5MDAw&#13;
MDAwWhcNMTgwNjE5MDAwMDAwWjB6MRAwDgYDVQQDDAdGaXJtYSBBMRAwDgYDVQQKDAdGaXJtYSBB&#13;
MQ4wDAYDVQQLDAVGaXJtYTEMMAoGA1UEBhMDc3JiMRowGAYJKoZIhvcNAQkBFgtmaXJtYUBhLmNv&#13;
bTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE2MTQwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEK&#13;
AoIBAQCq+r0vhN2WlE0P9oCdhr3r0hyR5XKMa0NXUMez8a+0VhEe5bqCJfGObdJS1W1NChFMiioF&#13;
It+kwF4k4NoCHqsAJCkCBbKZTiltFfPtQg+GGmTI14RfC2Xrcgs060iPpswa0qePpyYxjM29ShAG&#13;
LFsVNKCLGLc733pn9i9FAuBbWhvGKigIGhm4UScWV9xTMK0cTlea9lRazgSM0D+iP0fasnfhIwHP&#13;
z1c3JOXRMFCHhk9jDRbHMMkDKu0AYtZo+rW87IDw+ddffeRAcYHtklVNUOWwWgPd+1ZhDrf8s+yG&#13;
ozc/wET+5q/yW5SFVxVEMIN+++m+aYlJWLt8rTNjhBDtAgMBAAGjEDAOMAwGA1UdEwEB/wQCMAAw&#13;
DQYJKoZIhvcNAQELBQADggEBABPql7l2SOkUU7ON9SEqNswIVn+RyAL+Y/9OBJ+0aU0lcvpgbFNZ&#13;
5GsCMufSLRK0z1HU2rKW969FAnxAbfvMAvTh8a1VKuSF1P259bjFSoCekPfDW8irKtdBwlXUQtfn&#13;
Av2mVWLhk9XhBQtN78BktFLuXG7aRfbgb6L/e9M6Z1XFM8QK5WzBo1Y/7C7js7R0thIX9OsBs0gD&#13;
yoK644NxtAH2JljgqREpcjKZwNhfXZ++SIK8O5zUM7hlo1C7N1XqkURhc7J5ADRIHf5cOJCqiE6d&#13;
Q2WnEbguq2W6D5tTN/qjfkOtu1AWa29vz3O2piue9WkfIqxC84/llz20jrIWfow=
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>